### CURSO DE PANDAS

## Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,-3,8])
obj

0    4
1    7
2   -3
3    8
dtype: int64

In [3]:
obj.values

array([ 4,  7, -3,  8])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,-3,8], index = ["a","b","c","d"])
obj2

a    4
b    7
c   -3
d    8
dtype: int64

In [6]:
obj2["c"]

-3

In [7]:
obj2[obj2>0]

a    4
b    7
d    8
dtype: int64

In [8]:
obj2*2

a     8
b    14
c    -6
d    16
dtype: int64

In [9]:
data = {"venezuela":3000,"colombia":50000,"peru":60000}
obj3 = pd.Series(data)
obj3

venezuela     3000
colombia     50000
peru         60000
dtype: int64

### Dataframe

In [10]:
data = {"pais":["venezuela","venezuela","venezuela","colombia","colombia","colombia","peru","bolivia"],
        "años":[1990,2000,2001,2002,2003,2004,2005,2006],
       "valor":[1.5,2.0,2.1,2.2,2.3,2.4,2.5,2.6]}
df = pd.DataFrame(data)
df

        pais  años  valor
0  venezuela  1990    1.5
1  venezuela  2000    2.0
2  venezuela  2001    2.1
3   colombia  2002    2.2
4   colombia  2003    2.3
5   colombia  2004    2.4
6       peru  2005    2.5
7    bolivia  2006    2.6

In [11]:
df.head()

        pais  años  valor
0  venezuela  1990    1.5
1  venezuela  2000    2.0
2  venezuela  2001    2.1
3   colombia  2002    2.2
4   colombia  2003    2.3

In [12]:
df.tail()

       pais  años  valor
3  colombia  2002    2.2
4  colombia  2003    2.3
5  colombia  2004    2.4
6      peru  2005    2.5
7   bolivia  2006    2.6

In [13]:
pd.DataFrame(data, columns =["años","pais","valor"])

   años       pais  valor
0  1990  venezuela    1.5
1  2000  venezuela    2.0
2  2001  venezuela    2.1
3  2002   colombia    2.2
4  2003   colombia    2.3
5  2004   colombia    2.4
6  2005       peru    2.5
7  2006    bolivia    2.6

In [14]:
df2 = pd.DataFrame(data, columns =["años","pais","valor","cant"], 
                   index = ["uno","dos","tres","cuatro","cinco","seis","siete","ocho"])
df2

        años       pais  valor cant
uno     1990  venezuela    1.5  NaN
dos     2000  venezuela    2.0  NaN
tres    2001  venezuela    2.1  NaN
cuatro  2002   colombia    2.2  NaN
cinco   2003   colombia    2.3  NaN
seis    2004   colombia    2.4  NaN
siete   2005       peru    2.5  NaN
ocho    2006    bolivia    2.6  NaN

In [15]:
df2.columns

Index(['años', 'pais', 'valor', 'cant'], dtype='object')

In [16]:
df2["pais"]

uno       venezuela
dos       venezuela
tres      venezuela
cuatro     colombia
cinco      colombia
seis       colombia
siete          peru
ocho        bolivia
Name: pais, dtype: object

In [17]:
df2["cant"] = 1
df2

        años       pais  valor  cant
uno     1990  venezuela    1.5     1
dos     2000  venezuela    2.0     1
tres    2001  venezuela    2.1     1
cuatro  2002   colombia    2.2     1
cinco   2003   colombia    2.3     1
seis    2004   colombia    2.4     1
siete   2005       peru    2.5     1
ocho    2006    bolivia    2.6     1

In [18]:
df2["cant"] = np.arange(8)
df2

        años       pais  valor  cant
uno     1990  venezuela    1.5     0
dos     2000  venezuela    2.0     1
tres    2001  venezuela    2.1     2
cuatro  2002   colombia    2.2     3
cinco   2003   colombia    2.3     4
seis    2004   colombia    2.4     5
siete   2005       peru    2.5     6
ocho    2006    bolivia    2.6     7

In [20]:
productos = pd.read_csv("ProductosNuevos.csv")
productos.head(5)

,CÓDIGOARTÍCULO,SECCIÓN,NOMBREARTÍCULO,PRECIO,FECHA,IMPORTADO,PAÍSDEORIGEN,FOTO
0,AR50,ALTA COSTURA,TRAJE CABALLERO,"1,284.58",11/03/2002,VERDADERO,ITALIA,NaN
1,AR51,DEPORTES DE RIESGO,RAQUETA TENIS,"1,093.47",20/03/2000,VERDADERO,USA,NaN
2,AR52,DEPORTES DE RIESGO,MANCUERNAS,"1,060.00",13/09/2000,VERDADERO,USA,NaN
3,AR53,ALTA COSTURA,SERRUCHO,"1,030.20",23/03/2001,VERDADERO,FRANCIA,NaN
4,AR54,ALTA COSTURA,PANTALÓN SEÑORA,"1,174.23",10/01/2000,VERDADERO,MARRUECOS,NaN

In [21]:
a = np.arange(5)
a + 20

array([20, 21, 22, 23, 24])